{
    "DG CHK BS5 XREF ARRAY": "[MEDIUM] [UTILITY] [CM] Ignore the use of TMP in the MUMPS - it's just inefficient coding and has no effect beyond the function. This RPC gathers candidates that have the same last name as the Patient and the same last four digits in their SS#'s. Note the use of a custom social_security_number MUMPS index, BS5, needn't be replicated in Mongo. In Mongo, we could use a compound index on last name and last four numbers of social (make both first class fields). See [Pei's Test](https://github.com/vistadataproject/VDM/blob/master/prototypes/patientVICS/rpcPatientHardselect-spec.js#L196). Before marking this finished, replicate that the RPC behaves differently for sensitive patient (see MUMPS _DOB^DPTLK1_ call and SCREENing). and test __CPRS Behavior__ if ambiguity ie/ if > 1 patient has lastname/last four SSN combination", 
    "ORWPT TOP": "[READ/SELECT] [EASY] returns current patient ('top') selected. VISTA uses a global (DISV) to store the current patient. The _session_ object holds the current/selected patient in VICS. Partial emulation of ORWPT SELECT allows ORWPT TOP to be fully emulated in the national service", 
    "ORQQPL PROB COMMENTS": "[READ] Returns comments of Problem", 
    "ORQQPL INIT PT": "[EASY] [READ] Returns Death Indicator, SC and Exposures - key for demographics. Helped if _CHEYCLONE_ but not essential. Seems to be superset of _ORWPCE SCDIS_ - do at same time", 
    "ORWPT ENCTITL": "[READ] [DIFFICULT] [CM] as related to others. Easy on properties of three files - roombed of Patient (explicitly IEN'ed), name and abbr of location (explicitly IEN'ed) and name of provider (explicitly IEN'ed). Performance hit as get across three collections. _Medium_ as need to consider centralizing and retrieving all relevant identifier information in the session object (logged in user, selected location, selected patient). __BUT tie to ORWU NEWPERS__ as part of location/provider selection. See [issue](https://github.com/vistadataproject/DataExtractNSync/issues/44) and need to better understand context of this and its related RPCs. Will need to see in __Problems__ and _Vitals_ where it appears with NEWPERS and _ORWCV VST_", 
    "ORWPT LIST ALL": "[READ] [MEDIUM] [CM] Lists 44 (fixed in MUMPS) patient file names and allows paging, sorted by name. B index is walked, not the file itself. In Mongo, need to sort by 'B' ie/ Label - must __see how paging through a sorted index works in Mongo__. Note that the old VDM version doesn't scale - it grabs all entries and sorts with _lodash_. Testing MUST have [a] 1000's of entries in the Patient file (just names for most) to allow scale testing and paging and [b] see if B index has all patient entries or are some entries, such as deceased patients removed? Also __want to see how CPRS pages__ ie/ does it pass in Name or Last IEN - both are supported. Note that SENSITIVE PATIENT and DEFAULT LIST don't seem to effect this generic walk of the whole patient file which means user may be presented with 'inproper' choices?", 
    "ORWPCE SCDIS": "[READ] [EASY] Service connected percentage and rated disabilities of Patient. Subset of __ORQQPL INIT PT__ (do with it)", 
    "ORQPT DEFAULT PATIENT LIST": "[UTILITY] [READ] [CHEYCLONE] [VDM] [CM] Not part of original captures but in Router Manager. Lot's of use of Parameter Service and different contexts (in Ward, in Clinic, for Provider etc). Lot's of scopes - for example, default provider (_P_) scope uses an _APR_ index on the 'treating provider' property of Patient. This was NOT implemented in VDM and should get a __VDM__ set of tests before national, pure JS emulation. See [data issue on more details from CPRS Manual](https://github.com/vistadataproject/DataExtractNSync/issues/30)", 
    "ORWPT DIEDON": "[READ] [EASY] Easy on property (date of death) check in 2. Ex of argument passed that shouldn't be ie/ Patient (DFN) already chosen?", 
    "OR GET COMBAT VET": "[EASY] [READ] VDM version seems to implement correct logic - today's date comes into play as does the property _combat_veteran_end_date_. Double check it. Must test effect of different dates", 
    "ORWPT1 PRCARE": "[READ] [DIFFICULT] [CHEYCLONE] [VDM] [CM] - Gets into teams for which we need accurate (clone-based) test data. Sean said __used in JLV__ to provide primary care provider info. See [data issue on teams](https://github.com/vistadataproject/DataExtractNSync/issues/29). Leave to end as may need CHEYCLONE (could go to B3)", 
    "ORWDX LOCK": "[UTILITY] [DIFFICULT] [CM] - pair with Unlock and part of overall _locking in Mongo design_. Lock Patient. Must implement locking (soft, interface enforced) locking. Self contained task. Also if always follows SELECT, then may roll into Selection. Note that though the name of this RPC suggests Orders, it is called and recalled in Allergy and internally the code says it _locks the patient chart_. Need to __test CPRS behavior__ if encounters a locked patient. Does this only effect changes such as editing an allergy OR does it stop a record being read? See [VDM Lock Issue](https://github.com/vistadataproject/VDM/issues/40) for notes to add here", 
    "ORQQPL EDIT LOAD": "[READ] Returns current values of Problem properties - preparation for Editing", 
    "ORWPT ID INFO": "[READ] [EASY] Identifying information of DFN (passed in but shouldn't be). Properties from Patient (2). The patient details returned are a subset of those returned by _ORPWT SELECT_.", 
    "DG SENSITIVE RECORD ACCESS": "[DIFFICULT] [DUAL] [SECURITY] [CM]. Involves file 38.1 (mark patient marked as sensitive), the key _DG SENSITIVITY_, if a user has an SSN and checking if a Patient is an Employee (does Patient have EMPLOYEE eligibility flag?) - see [Pei's Tests](https://github.com/vistadataproject/VDM/blob/master/prototypes/patientVICS/rpcPatientHardselect-spec.js#L256). See CPRS behavior for sensitive vs non sensitive patient selection both when a provider lacks the appropriate key and when she has that key. Want to see CHEYCLONE data too and if a Bulletin is sent when a sensitive patient is accessed (how will we replicate that?). This isolates a __small subsystem__ and draws in security which is part of VAM. Though marked _DUAL_, may just do Nationally ie/ intercept RPCs and control access to sensitive patients and log all accesses. Equivalent function could be retired in VISTA. Alternatively, will need to see if can know if a patient is marked sensitive - do 38.1 additions fire protocol handlers or create bulletins?", 
    "ORWPT PTINQ": "[READ]", 
    "ORQQPL LIST": "[READ] Returns list of Problems for Patient", 
    "ORWDX UNLOCK": "[UTILITY] [DIFFICULT] [CM] - pair with Lock. Unlock Patient.", 
    "ORWPT SELECT": "[READ/SELECT] [MEDIUM] [PARTIAL] [DUAL] [CM] only partial as the full response must continue to come from VISTA. This RPC does more than select the current patient things - it returns demographic and flag information and sets up or clears globals in VISTA. Some data like CWAD flags are not fully in scope for B2 and so the full response must continue to come from VISTA. As patient selection is intrinsic to the national service, the selection part of this RPC must be shadowed in the national service by setting 'current patient' in the session object. The emulation must be __flagged or tagged as PARTIAL__ so our documentation doesn't (yet) claim full emulation. Note if we move _Sensitive Patient_ tracking to the national services then see if selection is effected. For example, if a patient is sensitive but a user lacks the appropriate key, is there an error?"
}